
## Plan Result




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sendgrid_api_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.sendgrid_api_key will be created
  + resource "azurerm_key_vault_secret" "sendgrid_api_key" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name                    = "sendgrid-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "social-service-child-support"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sscs-tribunals-case-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#sscs-tech"
          + "environment"         = "staging"
          + "managedBy"           = "SSCS"
          + "source"              = "Vault sscs-aat"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3671,"Program":"tfcmt","SHA1":"","Vars":{}} -->